the
of
return
given
a
and
is
in
an
that
are
to
you
if
integer
array
number
be
where
it
each
all
can
for
1
n
with
two
from
or
any
there
one
0
at
by
such
not
integers
string
as
on
have
order
example
nums
length
x
following
-
same
this
i
has
will
minimum
0-indexed
no
may
value
2
only
note
answer
maximum
k
ith
after
sum
equal
which
possible
some
than
s
elements
first
must
its
should
then
every
we
true
also
otherwise
between
binary
positive
so
characters
more
-1
strings
3
list
other
left
into
values
exactly
find
element
right
false
represents
int
ie
your
times
row
index
least
m
make
different
size
time
most
them
both
sequence
j
contains
2d
choose
b
exists
result
they
tree
numbers
empty
nodes
operation
7
valid
letters
column
their
write
words
smallest
representing
want
arrays
when
matrix
move
sorted
either
once
node
type
non-empty
distinct
unique
character
query
three
multiple
do
starting
returns
cannot
consisting
class
indices
consists
key
total
digits
initially
another
implement
grid
operations
since
root
format
contiguous
position
does
large
adjacent
modulo
these
using
name
109
last
range
largest
represented
arr
indicates
new
within
without
considered
numsi
next
4
table
generated
set
less
initializes
object
defined
c
need
start
target
y
5
containing
substring
contain
function
letter
before
but
lowercase
second
remove
primary
means
form
remaining
inclusive
sql
schema
even
greater
path
subarray
cell
test
single
original
until
pair
consecutive
word
above
called
allowed
numbered
guaranteed
take
english
difference
up
strictly
steps
get
cases
id
end
use
respectively
denotes
product
reach
point
group
digit
change
game
rules
cells
current
edges
pairs
design
needed
moves
was
formed
score
conditions
non-negative
connected
used
while
assume
add
leading
perform
follows
longest
subsequence
very
edge
always
input
starts
void
four
step
present
day
square
labeled
points
algorithm
way
10
because
nums1
answers
however
amount
ascending
data
zero
distance
appears
who
appear
6
numsj
answeri
deleting
space
replace
ai
case
num
changing
whose
possibly
exist
many
pick
increasing
queries
lexicographically
represent
bi
9
becomes
would
person
ends
down
structure
t
final
1s
nums2
resulting
null
r
notice
impossible
could
rows
positions
required
still
d
top
good
linked
itself
varchar
moving
directly
output
cost
swap
val
removing
turn
alice
0s
including
children
below
returned
corresponding
takes
like
zeros
determine
absolute
direction
numslength
8
through
graph
delete
consider
process
groups
part
been
smaller
xi
price
previous
substrings
head
made
apply
count
arri
how
undirected
performing
among
common
alphabet
formally
line
decimal
divide
subarrays
jth
odd
information
32-bit
solution
z
edgesi
let
kth
accepted
task
types
ways
uppercase
people
representation
divisible
----------------------
color
optimally
become
go
too
prefix
p
placed
chosen
about
split
report
out
highest
goal
separated
search
yi
were
place
complete
height
call
permutation
obtain
over
whether
ordered
according
none
repeat
turns
play
actual
average
based
equals
those
spaces
currently
already
sort
except
city
queriesi
squares
playing
player
players
bob
initial
palindrome
abc
shown
lower
removed
date
coordinates
code
reverse
side
level
non-decreasing
l
duplicates
functions
travel
suppose
si
shortest
occurrence
days
lowest
know
child
written
stones
user
parent
define
ab
being
fit
occurs
together
leftmost
bottom
subset
arranged
obtained
bitwise
special
entire
visited
receive
seconds
parentheses
duplicate
mat
results
infinite
along
boolean
keys
derived
bottom-right
plane
built-in
outside
never
back
o
applying
area
long
pass
frequency
board
insert
colors
addition
10-5
random
visit
trees
located
top-left
found
complexity
described
water
third
paths
lists
forward
added
solve
1-indexed
minutes
during
per
interval
rearrange
filled
correct
partition
upper
select
satisfies
stone
construct
greatest
system
denote
choosing
expression
ids
concatenated
see
diagonal
necessarily
problem
prices
put
subsequences
ans
negative
e
describes
convert
follow
corner
connecting
instead
occurrences
immediately
might
tie
places
starti
endi
xor
rectangle
method
adds
power
lengths
subtree
leaf
create
flip
item
denoting
arr1
directions
floor
simultaneously
extra
divided
ones
rounded
stop
achieve
consist
concatenation
twice
s2
s1
standing
u
calculated
arrj
arrlength
check
division
again
col
passed
increment
map
------------------------
location
needs
money
changed
wants
just
assigned
front
belongs
coordinate
keep
unit
width
maximize
build
taken
employee
bits
under
ansi
satisfy
columns
relative
clockwise
east
full
round
traversal
white
red
blue
performed
please
removes
said
certain
modify
beginning
closest
replacing
assign
specific
inserts
runs
o1
rotate
divisor
minimize
rightmost
ending
foreign
x-axis
100
nth
sums
calls
increase
scores
condition
ui
vi
several
continue
wins
subtract
append
inserted
request
maximized
numsk
nums1i
exceed
done
concatenating
students
applied
asked
n-1
customer
modified
units
network
signed
stops
minute
employees
inside
prime
making
walk
building
having
supports
pointsi
destination
adding
meaning
wordsi
lefti
righti
123
minimized
pointer
constructed
colored
win
assuming
pattern
repeated
room
bst
pay
items
store
buy
sell
permutations
dictionary
inputs
properties
invalid
anywhere
program
trailing
student
etc
uses
backward
x-y
vertical
had
occur
friends
piles
-------------------
calculate
event
rotated
names
1st
road
run
additionally
arr0
rounds
nums0
work
larger
fn
accepts
encoded
horizontal
image
rotation
north
west
south
circular
gets
mentioned
11
fits
costs
constraints
year
decided
x1
x2
decide
vertically
2n
probability
text
sentence
stonesi
users
pricei
leetcode
followed
middle
begin
around
available
perfect
limit
include
depth
similarly
fewer
base
rearranging
lexicographical
25
belong
reaches
stock
pile
v
shows
-----------------------
circle
stream
neighbors
bit
2nd
company
4-directionally
across
swapping
bidirectional
piece
going
salary
higher
robot
winner
manner
h
jump
parallel
our
recall
instance
brackets
non-zero
subsets
support
implementation
longer
well
much
remains
counted
off
what
reads
rank
satisfied
covered
horizontally
g
w
cover
allow
solutions
divides
box
distribute
label
separate
stored
associated
userid
garden
pieces
answerlength
requests
dollars
included
share
replaced
converted
seat
differ
reversed
singly
balanced
rule
file
hold
intersection
particular
concatenate
evaluates
operator
weight
serialization
he
exam
-x
num1
num2
earliest
orders
continuous
free
placing
match
wait
pricesi
choice
friend
copy
enum
triplets
sequences
black
manager
nearest
generate
directed
candies
a1
a2
intervals
ri
15
ordering
non-overlapping
suffix
language
shape
finish
regardless
cities
slength
arrarrlength
strs
products
team
speed
land
rooted
similar
decreasing
series
course
gridij
stay
stack
01
onto
constant
in-place
memory
later
come
indexed
own
degrees
90
arithmetic
randomly
20
created
version
deleted
she
descendant
played
rectangles
mark
palindromic
repeating
ranges
composed
valuesi
print
subtraction
multiply
boxes
rearranged
rooms
leaves
alices
center
rating
chessboard
figure
olog
changes
comes
now
bool
arr2
swaps
seats
holds
nums2i
earlier
meets
costi
chose
rotating
intersect
judge
capacity
definition
examples
house
parts
broken
f
customers
able
taking
towards
y1
y2
wall
sides
sets
message
arrive
divisors
hi
future
transaction
update
coins
indicate
leave
events
enter
fully
double
candy
best
sign
insertion
inserting
0th
collect
3rd
23
excluding
completed
transactions
low
high
flips
labels
identical
anagram
lets
opposite
26
reorder
231
missing
vertices
world
arguments
numsi1
individually
completely
overlap
pop
encoding
cut
ensure
remain
push
doing
five
segment
merge
lose
reference
started
zeroes
draw
bottom-left
top-right
video
decrease
thus
ancestor
productid
doesnt
1000
answer1
answer0
finally
painted
equivalent
say
eat
reachable
321
sequentially
causes
balls
ball
hand
yellow
real
loses
rectangular
requirements
multiplication
constructor
methods
read
explanation
roots
server
visits
querieslength
merged
phone
country
symbol
specifically
meet
cycle
content
makes
sorting
operators
cycles
cards
website
provided
houses
denoted
expressions
tile
shift
disjoint
multiplied
numeric
interpreted
converting
arbitrary
received
rest
send
indirectly
transform
profit
additional
exact
die
generates
weights
block
blocks
contained
reports
age
evenly
far
satisfying
amongst
obstacle
4th
perm
permi
li
card
repeatedly
social
30
describe
surrounded
moment
word2
word1
buildings
unlock
1234
anagrams
bank
met
teams
reached
passes
subtrees
island
timei
matches
grouped
maximal
jumps
successful
repeats
partitions
maps
axis-aligned
printed
conversion
decoded
queue
includes
open
segments
public
threads
persons
lines
paint
endpoint
latest
timestamp
palindromes
his
sj
deletions
parents
strength
absx
car
frequent
lie
101
worker
workers
traveling
combination
month
facing
nothing
deletion
overlapping
away
triangle
quality
mean
minimal
treat
descendants
log
cardinal
nums2j
help
finished
counts
ignored
plus
beautiful
-------------------------
modifying
roads
21
abcd
absi
descending
leaving
varying
removal
green
determined
queriesj
diagonals
magic
updated
mathematical
partitioning
significant
coming
automatically
alternating
servers
perimeter
knight
runtime
overall
sale
aforementioned
key-value
field
furthermore
dot
email
formatted
diagonally
chooses
fill
sitting
alphabetically
rowi
increments
c1
skip
i1th
try
12
various
non-space
main
shapes
procedure
usual
shifts
i1
i0
percentage
customerid
dist
acb
keyboard
sent
processed
--
give
getint
pilesi
state
nodeval
capital
produce
shares
arr2j
arr1i
triplet
roll
differs
office
employeeid
slots
n2
radius
x-coordinate
y-coordinate
outgoing
neighbor
marked
combinations
compute
daily
period
media
differences
subsequent
duration
tiles
flipping
xs
locations
enough
60
ten
reduce
running
keeping
heights
languages
q
r1
independent
wikipedia
recursively
online
did
typed
numsnumslength
valsi
yields
andor
reformat
downward
labelled
hello
small
picked
milliseconds
earn
13
decrement
pushint
uj
direct
vj
centered
us
movement
better
themselves
partial
nested
applies
arrk
connection
trip
toi
fromi
forever
y-axis
straight
appended
notes
pushes
flowers
vertex
frog
thread
tasked
1th
unable
recent
boundary
record
mountain
star
aa
plant
quantity
begins
evaluate
topmost
collection
works
outer
filling
unfortunately
wrong
goes
counterclockwise
equally
command
endpoints
22
2s
allocate
pivot
river
bag
obstacles
ci
forming
234
yj
kind
recursive
ratio
fourth
xy-plane
affect
sold
allows
symbols
spell
factor
formula
coin
abcde
0000
compared
balloon
interface
matching
addint
cars
train
hours
increases
hour
vowel
b2
courses
logs
hhmm
24-hour
break
ever
vowels
wi
rate
belonging
calculates
absnumsi
necessary
ranking
ranks
rangesi
blank
aab
rearrangement
flatten
neighboring
cj
equation
erasing
strange
existing
accept
distribution
arrange
left-to-right
specified
mod
games
vice-versa
title
gridrowcol
eight
movements
ki
food
distributed
receives
objects
domain
local
address
him
seatsi
beauty
corresponds
baskets
basket
stand
matrices
custom
wrapping
handle
successfully
arrives
unary
pointers
leetcodecom
separating
n-ary
nary-tree
street
previously
evaluation
composition
partitioned
selected
writing
ik
orderdate
immediate
unsorted
ladder
well-formed
booking
gcdx
searchword
elapsed
messages
comprises
16
mapping
putint
hash
named
inputoutput
upcoming
gain
selling
bobs
list1
sizes
list2
arr1length
rolls
generator
constraint
desired
entries
managers
spiral
infinitely
indicating
numerical
numsn
sentences
face
session
activity
further
hidden
averages
occupied
degree
captured
reduces
routes
years
threshold
statement
show
script
emails
idi
built
restrictions
internal
getting
locked
unlocks
typically
phrase
few
nor
security
updates
tournament
moved
factory
cross
crosses
islands
uniquely
vals
experience
project
dashes
job
simple
matrixs
preceding
attend
eventsi
valuei
jumping
legal
aba
criteria
password
xn
fall
elevation
boundaries
resolve
queens
attack
pyramid
axes
iterates
iterator
encode
chunks
chunk
limited
factors
ugly
xy
view
fixed
regular
secret
happy
decode
forgot
restriction
deserialized
deserialize
environment
buffer
serialized
allocated
neither
trips
lying
unrooted
counter-clockwise
instructions
standard
department
managerid
themself
positioned
flower
backwards
tests
ring
eating
unless
eaten
s3
sn
competition
participating
ties
considering
40
sliding
window
warehouse
p1
pi
execute
500
50
denominations
solutionint
returning
simplified
retrieves
component
border
records
computed
her
folder
toward
intermediate
-231
tuples
subjected
sk
reaching
bounds
insertint
getrandom
compare
triple
testcases
viewed
heighti
here
finds
due
temperature
bus
distancei
likely
calculation
alphanumeric
shorter
counting
besides
individual
magical
videos
positioni
travels
colorsi
banned
s0
whole
132
cab
transformation
flattened
hasnext
expected
judged
assigning
traverse
startrow
startpos
discount
library
intervalsi
bags
105
painting
1-based
chess
00
float
parenthesis
appeared
pairsi
xj
school
fifth
puzzle
source
instances
half
therefore
complement
periods
refer
str1
str2
guarantee
lexicographic
ignoring
representations
poor
coli
f1
dice
ace
fraction
freely
lock
connect
assumed
choices
calling
bad
route
respective
parameter
balloons
container
sub
--------------------
continues
continuously
i-th
entering
submatrix
calendar
whenever
nums1length
apple
actually
drop
minus
cols
logsi
bracket
roadsi
access
anything
crossing
bef
kilometers
disti
14
a0
clock
others
rectanglesi
consecutively
indicesi
arrangement
forms
replacement
submatrices
alternate
held
05
speedi
counter
0-9
endtimei
starttimei
actions
orange
sleftirighti
diameter
floating
ranked
regions
pre-order
treenode
clear
variable
evaluating
chalkboard
printer
subgrid
calculator
error
provide
thrown
cuts
shuffled
uniformly
space-separated
digitsi
property
treesi
bsts
010
inorder
communicate
movie
movies
rope
configuration
knights
optimal
speciali
kinds
requestsi
asks
ratings
foods
listed
everyone
dollar
nobody
findint
merging
parenti
separation
xxxx
awesome
falling
cups
cup
sit
terms
info
files
contents
climb
fruits
fruit
hands
90-degree
computing
104
heads
ahead
arrival
load
dropped
24
formats
peoplei
carries
plot
plots
resultant
distributions
behind
applications
spellchecker
insertstring
searchstring
logical
inner
happen
shiftsi
shifting
i-1th
simply
nums2i1
maxsum
scheduled
--------------------------------------
specify
alphabetical
invert
flight
firsti
reserved
expressed
108
lead
finding
touching
ideal
cyclic
arrived
via
newly
passing
sends
divisibility
teacher
removekey
mapped
libraries
3n
mid
copied
stocks
loss
cd
entered
entry
empid
happened
entirely
reporting
pad
uniform
xcenter
ycenter
addnumint
73
peak
imagine
worddict
reused
segmentation
buttons
6th
5th
collecting
mine
cant
gold
valued
alength
aj
unrevealed
revealed
infected
rented
floors
someday
activities
activitytype
-3
designed
tested
presses
testing
pressed
domino
monotone
zigzag
fuel
transactionsi
typei
indexi
distances
compressed
details
old
provides
allotted
matter
driver
supposed
tallest
restrictionsi
api
implemented
roomsi
structurally
salaries
income
accounts
account
categories
plan
device
r2
join
bought
startvalue
display
agesi
older
conflict
ages
repair
robots
traveled
collide
repaired
lands
timej
song
songs
swapped
flipped
effect
chars
recover
---------------------------
working
213
joined
jobs
difficulty
enddayi
startdayi
numsr
numsl
tilesi
carpetlen
coprime
strong
asynchronous
resolved
promises
rejected
promise
solving
worth
questions
fibonacci
relation
king
queen
upon
bac
nextint
tells
run-length
rightward
tower
viewing
importance
bijection
numrows
align
transformed
cipher
booleanvalue
compact
obj
jsonparse
opening
closing
known
remember
realized
link
serializationdeserialization
reconstructed
serialize
yourself
transmitted
computer
trim
reset
trimmed
sticks
stick
subgraph
weighted
weighti
faces
stands
anti-clockwise
performs
fifo
deque
depending
simulate
double-ended
normal
peek
stacks
bloom
seq
knows
enters
owner
numsright
numsleft
though
executed
foo
linear
deletes
isfull
checks
rear
principle
isempty
011
splits
tied
systems
votes
gives
live
max
singly-linked
height-balanced
angles
p2
transfer
incoming
deposit
withdraw
withdrawint
depositint
balance
transfers
popular
machine
stores
tweet
followerid
listinteger
feed
tweets
post
tweetid
signifies
grow
sure
instantaneously
plants
plantsi
watering
refill
journey
bricks
quantities
doctors
eats
signs
folders
truncate
collects
selection
2x
obtaining
proven
lies
arr2length
-2
related
removeint
trap
raining
labelsi
lower-case
wordsj
frequently
64-bit
contour
34
57
citys
flat
acceptable
skyline
tic-tac-toe
indexes
nums1j
factorial
incorrect
temperatures
parser
levels
reformatted
-k
police
smart
alerting
rob
contact
night
buses
operates
completing
ij
cousins
kingdom
strengths
army
skills
skill
filter
nine
views
stations
gas
tank
miles
station
reduced
init
mouse
cheese
net
bill
pays
underlined
case-insensitive
0110
percent
312
attributes
attribute
doubly
1100
dots
browser
url
history
res
initialize
unknown
numsk-1
attempt
ability
home
startcol
hexadecimal
addresses
upper-case
paper
popped
pushed
rods
identified
past
diagram
dial
yyyy-mm-dd
mm
001
answerx
ancestors
integral
wide
pointslength
images
erased
inverse
huge
sub-array
multi-dimensional
sub-arrays
121241510
2510
gcd
increased
sx
ty
sy
tx
million
glass
liquid
unsigned
two-dimensional
existed
ascii
avoid
kept
assert
removeduplicatesnums
assertions
expectednumsi
expectednumslength
expectednums
term
multiplicity
tokens
cutting
1101
causing
removals
numsik
worst
euclidean
signal
gridrowicoli
turned
fn-1
coinsi
6-sided
rollsi
logged
login
slot
dead
turning
dates
mutate
death
family
dies
birth
tasksi
tasks
aalength
unlimited
lca
context
undefined
burst
bursting
shop
engineer
fx
locks
walking
placement
xth
splitting
components
ratingi
median
app
productname
sales
saleid
reversing
appends
stonevalue
objective
wordlist
wish
expiration
pos
tails
internally
capitalization
decreases
rotten
i2
smash
destroyed
happens
nums2length
proved
encodedi
spelling
press
requires
rings
button
keyi
aligned
metal
apples
c2
triples
answerj
filtered
prerequisites
manhattan
afterward
nice
resulti
erase
pref
prepending
1n
gridi
gridm
grid00
pointing
self-edges
connects
action
constructs
token
unchanged
memoized
cached
keeps
gridrc
obstaclesi
sequential
relationship
relations
examine
f2
tell
gardens
planted
pathsi
frogs
mixed
cookies
question
marks
safe
typing
012
summation
callback
drops
driving
finishing
unoccupied
case-sensitive
ranksi
wordslength
maintained
edgesj
pushing
movecost
reconstruct
row2
row1
col2
col1
lost
b1
meeting
reading
fair
even-indexed
odd-indexed
startj
-9
-5
si1
holding
an-2
an-1
timesi
meetings
28
bound
s1i
repetition
pig
giving
status
denominator
flowersi
correspond
frequencies
exceeds
cache
recently
nums2i2
appending
shuffling
half-closed
simplicity
pairwise
closed
attempts
filetxt
ingredients
slices
slice
33
occupies
population
bulbs
exclusive
contrast
skipped
squared
candidates
maintain
connections
big
connectionsi
bacd
bc
numsnumslength-1
invalidate
indexing
drawing
vote
permitted
finishes
110
primes
forwards
arrow
arrows
non-leaf
ended
abcdefuvwxyz
vyz
situated
spread
lakes
flood
12345
arrleftright
attain
numi
2359
disturbing
filtering
words1
words2
mini
hire
paid
unused
orderid
waiting
boardrc
curr
tickets
close
collected
--------------------------
respect
bar
searches
27
numerals
executing
planning
lined
powx
forest
instructed
efficient
efficiency
graphi
reuse
fibonacci-like
weak
costij
pascals
beyond
eee
traversed
optionally
enhances
456
sometimes
fnarri
instruction
precedence
preparing
pid
valuediff
indexdiff
kitchen
oranges
score1
score0
score25
candles
plates
plate
candle
holes
backslash
escaped
subdivide
xcnti
maxmoves
chain
cnti
x3
xcnti-1
nums21
nums10
nums11
nums20
nums1n
nums2n
variation
zuma
equationsi
contradiction
-10
dj
equations
solid
targetgrid
targetgridrowcol
subgrids
raises
subtracts
multiplies
exponentiation
serves
getresult
chaining
ballsi
carefully
abcabc
nextvisiti
nextvisit
treesj
1010
type-2
type-1
0100
preorder
movierating
review
rated
createdat
february
movieid
2020
well-fenced
expensive
fence
enclosed
gridrowcolth
illustrates
offers
specialij
specialin
needsi
offer
ni
numsendi
numsstarti
cuisinesi
cuisine
highest-rated
foodsi
highestratedstring
ratingsi
foodratingsstring
cuisines
alphabetic
foodratings
newrating
changeratingstring
contaminated
rootval
recovered
treenoderightval
treenoderight
treenodeleft
findelements
recovers
treenodeleftval
findelementstreenode
treenodeval
override
joinedarray
modification
descriptionsi
descriptions
childi
islefti
somewhere
10-13
---xxxx
masked
personal
--xxxx
0-3
asterisks
mask
leftright
dispense
hot
amount2
amount1
cold
dispenser
amount0
warm
alex
lcpij
aaca
lcp
aabd
wordin-1
wordjn-1
fncontent
directory
fntxt
f1content
rootd1d2dm
f2content
f1txtf1content
f2txtf2content
directorypathfilenametxt
fntxtfncontent
f2txt
f1txt
staircase
basket1
minbasket1ibasket2j
basket2
couple
couples
switch
intersected
correctly
headb
skipa
linked-lists
listb
lista
intersectval
skipb
heada
retain
loadi
i2th
busiest
handled
busy
k-1
arrivali
computational
restricted
populate
struct
subdomain
d1d2d3
count-paired
9001
cpdomains
implicitly
discussleetcodecom
domains
com
rep
subdomains
d1d2
carry
boat
boats
farthest
classroom
cheating
efficiently
trie
pronounced
dataset
retrieve
autocomplete
startswithstring
subexprn
subexpr2
subexpr
subexpr1
integer-sided
op1
conventions
rational
op2
negation
op3
adhere
directioni
groupsi
nums1ik
nums1i1
nums2ik
nums1i0
minnums2i0
minsum
digitsumx
preferred
precisely
deliveryid
delivery
customerprefdeliverydate
rungs
rung
za
abcdefghijklmnopqrstuvwxyz
copies
toeplitz
layout
fingers
flights
bookingsi
bookings
lasti
a-b
lcm
non-coprime
storeroom
cubic
cube
initialized
magicdictionary
builddictstring
resend
master
originating
instantly
replies
periodically
resending
gone
arriving
patience
reply
channels
channel
patiencei
idle
processing
divisorsi
exchanges
lo
restart
chalki
chalk
hashmap
myhashmap
deep
randomindex
xrandom
brand
operationday
stockname
gainloss
buying
concatenates
ath
bth
list1s
arr2i
arr1j
pos1v
pos2y
pos2z
pos2v
pos2x
pos1z
pos1x
pos1y
introduced
rollmax
rollmaxi
simulator
packages
weightsi
package
belt
shipped
ship
port
conveyor
recolor
blocksi
intime
spent
eventday
1440
outtime
exits
hourglass
reportsto
anyone
pack
left-justified
greedy
justified
approach
maxwidth
abssum
solutiondouble
randpoint
circumference
finite
targety
targetx
lucky
tastiness
sells
summarize
getintervals
summaryranges
seen
summary
-55
ns
-255
763
peaks
nums-1
parity
i-2th
up-left
2-9
telephone
natural
greatness
permuting
permute
0-based
52372
numsliri
max15
pairing
max6
44
reveal
deck
decki
uninfected
infection
designated
relaxation
manages
active
scrolldown
endsession
inclusively
sessionid
2019-07-27
sendmessage
opensession
activitydate
differencesi
hiddeni
567
5247
surprisingly
alien
releasetimes0
keypresses
keyspressed
releasetimes
keyspressedi
tester
keypad
releasetimesi
keypress
released
tiling
tromino
tilings
os
capture
region
fw
fqueriesi
fs
dcce
locationslength
locationsi
locationsj
cashbacki
wasted
resize
designing
resizing
sizet
dynamic
numst
word2length
word1length
word2j
word1i
overwriting
vali
versa
vice
passengers
gender
passenger
ababc
compile
maxheighti
rand7
argument
rand10
shouldnt
1238
5674
5678
pangram
suffixes
20000
50000
category
monthly
accountid
divi
div
word0i
banki
while1
beam
activated
laser
beams
interfere
devices
anti-theft
productkey
queryindicesi
queryindices
querycharactersi
querycharacters
lengthsi
revealing
click
clickr
minesweeper
clickc
char
mines
younger
conflicts
scoresi
basketball
cameras
camera
monitor
install
10921
limits
positionj
limitj
roboti
repairs
factoryj
factories
dth
floorpilesi
floorx
minimums
suggests
suggested
ideab
naming
ideaa
ideas
voyage
mistake
experienceyears
projectid
formatting
reformatting
firstly
originali
derivedi
original0
difficulties
schedule
jobdifficulty
dependent
jobdifficultyi
mhts
minh
transpose
switching
0316227
3627
widths
sentence1
jane
my
sentence2
havent
cancelfn
cancel
args
attending
numsr-1
numsl1
carpet
even-numbered
odd-numbered
val2
val1
validly
gcdval1
violates
resolves
reason
rejects
promiseall
rejection
reject
marksi
typesi
counti
indistinguishable
xn-2
xn-1
rain
swim
everywhere
stampheight
stamps
stampwidth
customstackint
pops
customstack
incint
maxsize
promise1
promise2
xqueeni
ad
xking
yking
yqueeni
queensi
requestsj
resultj
patterns
stacked
three-letter
aesthetically
triangular
beneath
stacking
pleasing
homogenous
gifts
380925
rle
3825
rleiterator
rleiteratorint
281825
encodingi
exhaust
exhausted
exhausts
88855
separates
battleship
battleships
verticalcutsj
cake
verticalcuts
horizontalcuts
horizontalcutsi
usage
usa
google
capitals
10-6
3-dimensional
projection
looking
planes
zx
projections
yz
shadow
2-dimensional
cubes
indirect
employeesiid
subordinates
employeesiimportance
employeesisubordinates
px
disconnected
font
paypalishiring
legibility
pahnaplsiigyir
convertstring
engage
substituted
boy
appearance
substitution
falsy
json
sized
numsij
maxbik
bij
signfuncx
signfuncproduct
floornumsi
twins
n-1-ith
twin
maintaining
commas
seperate
wrote
creative
serializes
clarification
approaches
multiplicand
kith
trimi
faulty
crashtime
memory1crash
memory2crash
crashed
crashes
memory1
consumes
memory2
non-adjacent
tripsi
halve
dest
src1
src2
lastly
constituent
tape
rotations
layer
layers
cyclically
bce
cae
peekpop
natively
supported
myqueue
arrx
arry
top-to-bottom
orderings
bloomdayi
bouquet
bloomday
bouquets
seqi
seqlength
unvisited
customersi
grumpy
bookstore
throughout
grumpyi
technique
numsleft1
x1y1x2y2xnyn
x1x2xny1y2yn
seq0
seqk
forwardbackward
numsseqj
puts
seq1
involving
comprehensiveness
mainly
printsecond
printthird
seem
imply
operating
mechanism
printfirst
tright
tleft
mycircularqueuek
enqueueint
programming
benefits
mycircularqueue
dequeue
carpets
floori
visible
numcarpets
splicing
dimensions
presented
favoritetypei
favoritedayi
candiescounti
dailycapi
candiescount
invertx
reversex
reverseinvertsi
0111001
inverts
011100110110001
s4
4x
finalsum
summing
insertfront
deletefront
deletelast
getfront
mycirculardequeint
getrear
mycirculardeque
insertlast
voter
position-one
voters
mink
fixed-bound
maxk
living
introverts
happiness
introvertscount
extroverts
120
extrovert
introvert
extrovertscount
plotting
dayi
stockpricesi
stockprices
chart
matlab
parameters
handy
reshape
wanted
reshaped
row-traversing
rides
travelleddistance
barcodesi
barcodes
barcode
p4
p3
automate
transferint
account1
banklong
withdrawn
account2
balancei
transferred
prioritizes
withdrawing
300
600
banknote
banknotes
handed
deposits
200
atm
banknotescount
pickint
picks
followeeid
followint
posted
posttweetint
unfollowint
getnewsfeedint
composes
news
unfollowing
followunfollow
twitter
odd-length
multiples
attendance
award
absent
eligible
late
graphs
30000
baa
ababbc
abcbabcbcb
ac
cans
waters
capacities
capacitya
alicebob
capacityb
hisher
progression
s1s
hi1
furthest
ladders
storekeeper
trying
quantityi
candytype
noticed
candytypei
likes
doctor
advised
advice
dinnerplates
dinnerplatesint
popatstackint
preserved
namesi
exams
scoreij
got
eval
span
quotes
today
todays
7212
73412
stockspanner
numsnumsnumsk
numsnumsk
21347112918
18291174312
answerrc
topleftrc
bottomrightrc
lx
xr
xl
rx
rxxlrxrxl
weekly
congratulate
remaps
contest
sneakily
remap
d2
replaces
danny
d1
remapping
326
mittal
trimming
square-free
unreachable
destvalue
step-by-step
randomizedcollection
multiset
linearly
heightmap
volume
cba
abacba
abca
bcfd
wordlength
on2
mode
occurred
modes
cdabef
cdefab
efcdab
efabcd
abcdef
abefcd
acdbef
325
min-product
grounded
skylines
x1y1x2y2
ground
512
geometric
surface
termination
collectively
buildingsi
absolutely
511
silhouette
clumsy
factorial10
clumsy10
distinctly
122
third-largest
second-largest
recorded
correcting
worse
stockprice
updateint
market
nature
volatile
hit
2xi
player2
player1
bowling
pins
warmer
rectsi
rects
interpretation
al
interpret
parsers
depicted
biggest
corners
purple
45
rhombus
non-null
extending
end-nodes
license
dash
2k
thief
directly-linked
entrance
himself
thievery
tour
influence
totaltrips
independently
successively
arr1i-arr2j
xored
secondi
wizards
wizard
ruler
strengthi
weakest
reqskills
sufficient
people0
people1
people3
surrounding
smoother
rounding
img
grayscale
1221121221221121122
obeys
trios
trio
translates
byte
octet
n-bytes
1-byte
0xxxxxxx
utf8
-------------------------------------------------------------
10xxxxxx
11110xxx
110xxxxx
unicode
1110xxxx
bytes
utf-8
idsi
creators
viewsi
platform
creator
creatori
popularity
comprising
numsindex
stationsi
fueli
drives
refueling
refuel
mile
liter
liters
startfuel
transferring
reducer
arrayreduce
fnval
fninit
reward1
mice
reward2i
reward2
reward1i
season
achievable
reside
lemonade
billsi
bills
nestedinteger
randomizedset
aebdc
aeb
uncommon
enjoyyourcoffee
coffee
enjoy
paragraph
1110
closer
listing
labeling
addattailint
pointerreference
addatheadint
deleteatindexint
addatindexint
prev
indexth
mylinkedlist
112
3001
deci-binary
deliciousness
deliciousnessi
meal
meals
defines
convenience
----
transformations
morse
international
onlogn
facebookcom
page
browserhistoryforward2
visitstring
browserhistoryvisitfacebookcom
browserhistoryback1
browserhistoryvisitlinkedincom
5000
tab
browserhistoryvisitvisitvisitbackbackforwardvisitforwardbackback
homepagelength
homepage
browserhistory
browserhistoryvisityoutubecom
clears
linkedincom
browserhistoryback2
browserhistorystring
leetcodecomgooglecomfacebookcomyoutubecom111linkedincom227
browserhistoryforward1
forwarding
nullnullnullnullfacebookcomgooglecomfacebookcomnulllinkedincomgooglecomleetcodecom
googlecom
urllength
youtubecom
browserhistoryback7
backint
browserhistoryleetcodecom
browserhistoryvisitgooglecom
forwardint
nestediteratorlistnestedinteger
iteratorhasnext
iteratornext
pseudocode
nestedlist
nestediterator
numsdivide
0124445667
4566701244
numsn-1
numsk1
winston
funcarr
func
mysterious
workerj
profiti
difficultyi
bigger
homerow
rowcosts
homecol
colcosts
colcostsc
incurs
homepos
rowcostsr
ln
l2
l0
linked-list
l1
deepest
preceded
1e5
single-space
biginteger
20010db885a3000000008a2e03707334
x1x2x3x4x5x6x7x8
192168100
queryip
2001db885a3008a2e03707334
192168011
19216811
20010db885a38a2e037j7334
xilength
ipv6
x1x2x3x4
255
19216810
020010db885a3000000008a2e03707334
ipv4
ip
citations
published
researcher
papers
cited
h-index
citationsi
logarithmic
researchers
stonesj
assignment
maxoperations
penalty
billboard
welded
weld
steel
installation
installing
bb
abbxxxxzyy
yy
36
encodedstring
kencodedstring
3a
beans
bean
bishops
r-1
bishop
positionsi
rook
occupy
rooks
piecesi
c-1
diagaram
indicated
aug
oct
1900
jun
nov
apr
mar
jan
jul
2100
dec
30th
feb
31st
dd
yyyy
sep
089
0090089
9089
0090
priority
redundant
richer
quieti
quiet
quiety
situation
logically
quietness
richeri
definitely
oriented
truncating
punctuation
uni-value
posy
posx
vision
angle
tag
obstruct
determining
angle2
addbackint
popsmallest
smallestinfiniteset
x-values
translation
img1
translated
borders
img2
translate
arrayflat
nesting
flattening
k-similar
hashset
containskey
addkey
myhashset
permn
ratios
maximizes
classesi
brilliant
passi
totali
extrastudents
beforehand
classes
gcds
4616
shelfwidth
shelf
thicknessi
bookshelf
book
thickness
bookcase
booksi
shelves
books
sub-boxes
3x3
1-9
sudoku
blocked
blockedi
1337
n-digits
arraywrapper
comma
features
prefixi
quarter
pictured
excess
champagne
poured
pouring
100th
glasses
maxdoubles
compiler
hamming
notation
java
stages
basically
averageprice
intersecting
unitssold
purchasedate
enddate
startdate
isleaf
bottomleft
bottomright
recurse
topright
sub-grids
proper
photo
terminator
sub-grid
topleft
wiki
matrixes
quadtree2
quadtree1
quad-tree
mapsum
overridden
sumstring
key-val
music
boredom
playlist
listen
playlists
notepad
screen
paste
early
friendshipsi
transitive
languagesi
friendship
teach
friendships
important
things
triangles
convex
triangulate
polygon
triangulation
n-sided
coefficient
evalvars
3bb
-6
alternates
well-formatted
variables
breaking
aabc
-2aaa
-1a14
5c
asterisk
3aab
evalints
evaluated
4a
sticker
stickers
skilli
chemistry
0001
refers
1111
0011
2p
non-star
stars
sremovablei
removable
removablelength
heroes
numsik2
minnumsi0
maxnumsi0
attractiveness
sortracker
addstring
queried
tracks
querying
invocation
scenic
invoked
tracker
inversions
global
towersi
qi
towers
qualities
cy
garbled
cx
illuminated
lampsi
answering
rowj
lamp
lamps
gridrowjcolj
colj
ansj
illuminates
arrk1
clock-wise
arrkn
f0
fk
arrk0
presence
went
fortunately
observations
observation
numerically
segmented
223
93
329
92
new2
2932
new1
deviceid
eventdate
playerid
gamesplayed
logging
displays
deadends
wheel
wrap
codes
wheels
weather
recorddate
yesterday
ti
maxcost
mutation
aaccggtt
gene
aaccggta
8-character
investigate
mutations
endgene
startgene
marking
kingname
well-defined
childname
successor
throneinheritance
getinheritanceorder
born
curorder
whos
grandchildren
successorbob
member
parentname
else
oldest
inheritance
successorking
throneinheritancestring
deathstring
someone
birthstring
successoralice
successorjack
jack
successorx
gave
son
successorxs
isbadversionversion
fails
versions
develop
developed
k-sum
powers
answersi
powersj
pills
requirement
requiring
workersj
pill
encounters
yielding
sqrt
constructa0
routine
constructb
constructai
constructa
gasi
circuit
freq
sublists
sublist
decompressed
bonus
supervisor
const
taxrate
appropriately
consolelogthe
tax10
appropriate
enhance
taxcallpolyfillitem
callpolyfill
thisitem
functioncall
taxprice
salad
totalcost
wisely
pricesj
leetcodeproblems
folderi
sub-folders
folderj
sub-folder
numbercontainers
fills
changeint
3456
6345
3951
cycled
0158
0190
instructionsi
1235
12335
min2
fxy
fint
customfunction
findsolution
functionid
implementations
monotonically
callable
newi
mappings
oldi
mappingsi
non
non-increasing
acquire
determines
silver
athlete
athletes
scorei
bronze
medal
separator
thousands
soldier
ratingj
ratingk
soldiers
findmedian
medianfinder
janfebmaraprmayjunjulaugsepoctnovdec
revenue
follower
followers
solvable
secondary
30254
overflowing
302548
productofnumbersadd5
productofnumbersgetproduct4
productofnumbersgetproduct2
getproduct
302
getproductint
3025
productofnumbersadd2
productofnumbersgetproduct3
nullnullnullnullnullnull20400null32
productofnumbersadd4
32
productofnumbersadd3
productofnumbersadd8
productofnumbersadd0
productofnumbersaddaddaddaddaddgetproductgetproductgetproductaddgetproduct
3025423482
productofnumbers
goods
sslength
conductor
rid
illegal
strict
produces
fruitsi
farm
visiting
walks
4-directional
non-obstacle
minnumsi
beginword
endword
wooden
cutsi
variance
ors
un-expired
getkey
setkey
inaccessible
setting
overwritten
pattern1
pattern0
uniqueid
employeeuni
reordered
watered
tap
one-dimensional
taps
capitalized
capitalize
defeating
initialexperience
opponents
energy
energyi
defeat
initialenergy
experiencei
training
opponent
fresh
elapse
numsi2
numsi0
numsindexk
numsindex1
index1
numsindex2
expressible
indexk
index2
2h
heaviest
reordering
implementing
cause
bookint
half-open
mycalendar
logn
logm
matij
om
article
viewer
authorid
articles
viewdate
author
articleid
authors
viewerid
cellsi
cith
rith
flooded
repetitively
1021
2-1
colorful
neededtimei
neededtime
stage
door
anticlockwise
pressing
spelled
keyword
trail
fallout
purpose
1200
quest
engraved
freedom
searched
mi
maxnumsj
realimaginaryi
-100
imaginary
multiplications
complex
hasapple
spend
hasapplei
ocurrences
rankq
matrixrowcol
answerrowcol
rankp
hotel
minsizej
preferredj
absid
sizei
roomidi
shiftz
shiftt
shifta
myemailcom
forwarded
alicezleetcodecom
everything
mails
mail
mynameemailcom
aliceleetcodecom
emailsi
prerequisitesi
numcourses
outermost
decomposition
primitive
nonempty
pk
2d-plane
stable
brick
erasure
disappear
hitsi
falls
hits
erasures
uncolored
aca
ca
abaca
decrements
getminkey
incstring
getmaxkey
allone
decstring
numnegones
numzeros
-1s
numones
numzeroes
spots
valuesj
sightseeing
spot
bitwise-and
gridin
typewriter
graphv
bipartite
graphu
extended
authenticationmanager
countunexpiredtokens
renew
timetolive
generatestring
expiry
expire
expires
renewstring
renewed
unexpired
tokenid
renews
potentially
authenticationmanagerint
authentication
countunexpiredtokensint
currenttime
numspivot
necesssarily
comprised
upgradeint
lockingtreeint
upgrade
parent0
upgraded
locking
lockingtree
unlockint
unlocked
prevents
lockint
southeast
northwest
eventually
rstart
cstart
grids
bitwise-xor
prism
0-height
shaped
solutionlistnode
taller
str
abdbec
n1
abcabcabc
bolded
121000
102001
newnumsi
minnums2
maxnums2
newnums
prerequisite
nextcoursej
relationsj
prevcoursej
months
acyclic
releaseoxygen
bond
molecules
barrier
enforces
paired
worry
barriers
hydrogen
synchronization
releasehydrogen
oxygen
bind
molecule
explicitly
fn-2
lockedi
collided
involved
stationary
collision
motion
collisions
collides
directionsi
staying
equal-length
differencei
wordsij
differenceij
wordsij1
uselimit
numwanted
guess
guessing
non-horizontal
senders
sendersi
sender
chat
messagesi
sleeps
millis
arrlefti
arrrighti
abbca
appeal
ps
numarray
sumrangeint
numarrayint
croak
printing
croakoffrogs
croaks
insertions
processid
processes
machines
processingtime
machineid
greed
gi
cookie
-numsi
knowledge
quotation
knowledgei
nameisageyearsold
highlimit
infinity
lowlimit
scrambled
scramble
incurred
012345
peculiar
checking
protected
345
unmarked
bottom-up
sumnumsi-numsj
unsubscribe
subscribing
emit
enables
subscribe
callbacks
emitting
emitted
subscriptions
referentially
subscribed
listeners
eventemitter
dom
optional
nodejs
meters
distance3
distance1
distance2
distance0
nummoves
keytime
alert
2251
2352
emits
0949
doors
key-cards
keytimei
keyname
saves
keynamei
keycard
key-card
2351
one-hour
rents
rent
moviei
resj
unrented
renting
searching
cheapest
rental
shops
movierentingsystemint
dropint
moviej
movierentingsystem
entriesi
generating
listlistinteger
searchint
shopi
shopj
rentint
great
positives
garbagei
assortment
truck
responsible
trucks
picking
traveli
garbage
sessions
sessiontime
assumes
landing
grows
applesi
rot
daysi
dfe
def
adc
125
suit
poker
flush
suitsi
suits
malfunctioning
properly
brokenletters
pj
maxtime
99
microwave
normalized
targetseconds
interested
generic
80
cook
startat
0954
finger
normalizes
81
fatigue
interprets
54
cooking
pushcost
hashvalue
valz
p0
vals0
valsk-1
pk-1
hashsub
hashs
vala
vals1
statementsij
truth
statements
statementsii
special-equivalent
xzzy
zzxy
xyzz
colsum
0-thupper
colsumi
column0-indexed
1-stlower
2-d
sumregion
nummatrix
nummatrixint
sumregionint
loweri
belonged
remembers
higheri
averageb
averagearr
averagea
monotonic
cbca
ignore
abccdef
insensitive
caaacab
12c
licenseplate
arts
similarity
tars
rats
letting
rests
kmh
06
skips
skipping
hoursbefore
index-0
uniques
6741
6174
61741
6141
t2
t1
tm
interleaving
t3
cloned
102
divisions
numsli
numsli1
numsri
2533
version1
revisions
revision
version2
2th
pillow
consistent
gregorian
profitsi
venture
projects
ipo
soon
resources
capitali
pure
preserve
0124567
4567012
createhelloworld
maxvalue
afterwards
forget
delay
discovering
discovers
31
arrivebob
arrivealice
leap
business
leavealice
5-character
leavebob
rome
mm-dd
taxes
percent0
upper0
tax
taxed
upper1
earned
percent1
percent2
upper2
upperi
percenti
upperi-1
bracketslength
bracketsi
s2j
logout
logouttime
0130
0015
seventh
2345
logintime
0045
midnight
blength
minalength
repeatlimit
repeatlimitedstring
descent
smooth
exempted
ransomnote
magazine
fed
pigs
survive
minutestotest
poisonous
bucket
buckets
consume
minutestodie
gift
numpeople
time-points
usersid
clientid
unbanned
cityid
canceled
cancelledbyclient
cancellation
2013-10-03
client
partner
requestat
2013-10-01
yes
dividing
role
driverid
cancelledbydriver
taxi
10101
unfairness
cookiesi
irreducible
countj
pointsj
repetitions
sub-sequence
departments
departmentid
gray
n-bit
13024
24130
rolling
sided
len
110100010
poeplei
downwards
trusts
everybody
rumor
town
trust
trusti
secretly
almost
shortening
tiny
service
tinyurl
decodestring
shorturl
encodestring
short
httpsleetcodecomproblemsdesign-tinyurl
httptinyurlcom4e9iak
companion
longurl
encodedecode
lru
evict
lrucache
lrucacheint
nums1k
nums2k
nums1i2
saying
count-and-say
countandsayn-1
countandsayn
3322251
countandsay1
accommodate
disqualification
mountainarray
mountainarrayget
mountainarrgetindex
mountainarr
mountainarraygetk
circumvent
mountainarraylength
interactive
submissions
doubled
favoritecompanies
favorite
favoritecompaniesi
companies
favorites
numsw
numsz
numsx
numsy
endpos
47
thin
describing
145177
mixj
sake
paintingj
mix
1412477
leftj
rather
rightj
section
colori
segmentsi
246
intersections
bi-directional
secondlist
endj
firstlisti
secondlistj
firstlist
illustrated
stopped
orthogonal
circularly
traversing-order
matrc
answerij
theres
10th
explore
tenth
possibilities
whitespaces
totaljumbo
cheeseslices
burger
burgers
tomato
totalsmall
jumbo
tomatoslices
abs
arrangements
four-person
reservedseats
38
exceptional
reservedseatsi
cinema
aisle
birthi
deathi
alive
r3g2b1
color-position
rod
librarys
toggle
bulb
128
self-dividing
arrlen
less-than-or-equal-to
fractions
complementary
studentsj
001112
0120
210
perpendicular
detectsquares
countint
treated
bannedi
bring
arrbannedi
decision
brainpoweri
solved
questionsi
commands
origin
-y
ologm
aeoiu
aeiou
es
aaaaaaeiiiioou
uaeio
aaaeeeooo
made-up
ma
goat
oatgma
applema
latin
consonant
fat
recyclable
lowfats
divisor2
divisor1
uniquecnt2
uniquecnt1
150
interesting
reorienting
transport
narrow
ministry
orient
0144567
4567014
abba
queries3
010221
abcda
falsetrue
queries2
modifies
aaa
palidrome
queries1
baab
queries0
330120031032041
lyb
queries4
truefalsefalsetruetrue
abcba
3000000
gdp
25000000
km2
bigint
continent
countries
twenty-five
list2j
list1i
cbtinserter
getroot
cbtinsertertreenode
yield
num1num2
hill
non-equal
hills
valleys
valley
2maximumbit
maximumbit
baseball
operationsi
calculations
ababb
iquerieslength-1
p123m
n-queens
row2col2
row1col1
getvalueint
rowcol
newvalue
subrectangle
updatesubrectangleint
subrectanglequeries
10n
innermost
plays
loosely
probabilities
draws
outcomes
gains
maxpts
comma-separated
accepterid
requestaccepted
requesterid
acceptdate
election
topvotedcandidate
cast
topvotedcandidateint
qint
personsi
belowi
colconditionsi
abovei
rowconditions
colconditions
rowconditionsi
asdfghjkl
qwertyuiop
american
zxcvbnm
countuniquecharst
countuniquecharss
carried
decrypt
occurring
decryption
decrypted
decryptstring
encryption
encryptstring
keysi
encrypts
encrypted
encrypterchar
encrypter
encrypt
twos
043
02
amounts
putrightfork
wantstoeatphilosopher
asking
fork
bowls
pickrightfork
putleftfork
pickleftfork
wikipediaorg
thinking
starve
behaviour
philosopher
think
silent
supply
demand
forks
stomach
philosophers
spaghetti
alternately
concurrent
discipline
commute
ride
107
floating-point
trains
depart
super
charged
eliminate
monster
weapon
defending
monsters
chargethe
alal1ar
lr
rededgesi
rededges
blueedges
blueedgesj
shot
taped
xstart
stretches
y-direction
spherical
xend
y-coordinates
pizzas
pizza
in-order
clips
sporting
clip
lasted
clipsi
postorder
numslots
strs0
strs2
strsn
strs1
latter
fire
safehouse
stayed
safely
grass
spreads
former
walls
dislikes
dislikesi
dislike
startcolumn
maxmove
floods
rains
rainsi
anslength
lake
dry
rainslength
sumnums2
1112131415
sumarr
11231415
sumnums1
1121345
nums1leftright
nums2leftright
routes0
routesi
dota2
rights
dire
ban
senate
voting
announce
strategy
party
victory
senator
radiant
parties
round-based
exercise
senators
predict
weirdly
inventory
inventoryi
patterni
3000
frame
recentcounter
pingint
ping
minn
parents0
genetic
parentsi
grid2
sub-island
grid1
sub-islands
queriesith
intlength
2019-08-16
changedate
newprice
ceiling
ceilval
ceilnumsi
digital
111
10111
distancethreshold
leftover
153
235
346
fortsi
forts
minij
maxij
fort
enemy
fortsk
veganfriendly
maxdistance
restaurantsi
filters
veganfriendlyi
restaurants
restaurant
maxprice
fib
fibn
factorialn
subsequence2
subsequence1
ans0
non-intersecting
ans1
roundsi
rounds0
track
rounds1
sector
circulate
marathon
sectors
kn
face-up
cbad
even-odd
acbd
cbda
targetwords
verifying
startwords
maxi
nums4l
nums3k
nums3
nums4
expectation
wage
wagei
qualityi
incompatibilities
distributing
incompatibility
widthjheightj
widthiheighti
widthi
width-to-height
interchangeable
ordernumber
customernumber
candiesi
bn
minai
spellsi
potion
potionsj
potions
success
spells
subroot
gcdnumsi
endi-1
pairslength
tries
favoritebrand
2019
itembrand
itemid
buyerid
sellerid
buyer
joindate
shopping
mechanic
garage
mechanics
-14-13
style
boustrophedon
destinations
snake
mincurr
simulates
boardn
perm2
perm2i
squareful
perm1i
perm1
overlapped
createcounter
planned
costs0
1-day
costs2
costs1
7-day
30-day
advance
365
poorquerypercentage
queryname
database
kelvin
180
27315
fahrenheit
celsius
3200
bval
aval
alicesizes
bobsizes
bobsizesj
alicesizesi
exchange
mat20
mat42
mat31
row1i
col2i
queryi
matxy
row2i
col1i
00010
10010
00001
ys
confirmations
timeout
confirmation
confirming
confirmed
signups
requested
signup
datetime
expired
abcdefg
cabbage
faced
baggage
puzzlesi
beefed
foobar
printbar
printfoo
wordfilter
wordfilterstring
suff
fstring
space-delimited
identifier
digit-logs
identifiers
letter-logs
fight
valiant
dungeon
rescue
imprisoned
princess
decides
quickly
health
demons
orbs
threats
power-ups
laid
guarded
orderwith
135
551
1351315
movesi
pending
columnnumber
excel
sheet
lastdayi
durationi
coursesi
kthlargest
kthlargestint
equivalency
eed
symmetry
transitivity
implies
equivalence
acd
s2i
basestr
reflexivity
cde
calculatemkaverage
mkaverage
mkaverageint
addelementint
usually
ii
xxvii
xii
ix
900
xx
400
six
roman
seven
iv
iiii
numeral
changenumi
mutating
3x
delayed
meetingsi
functionidstart
execution
0start3
endtimestamp
single-threaded
1end2
cpu
1j
stashed
professional
robber
robbing
stopping
tonight
competes
winners
against
firstplayer
advances
outcome
secondplayer
compete
movecostij
raised
2d-array
todelete
union
1321
array-form
zero-based
numsnumsi
hh
59
submitted
rewarded
eg
elementary
math
grade
352
rcenter
ccenter
row-wise
pr
transposition
accessed
encodedtext
ch
slanted
depict
originaltext
fashion
pickoldi
lefttorightj
regulate
bridge
righttolefti
waits
righttoleftj
putnewi
lefttorighti
warehouses
revisit
coordinatesi
abab
wonderful
ccjjc
separately
root-to-leaf
maxlocalij
maxlocal
xi1
xi2
uploaded
upload
uploadint
luprefixint
uploads
luprefix
k-values
3214
pancake
sorts
arr0k-1
lonely
defensej
defensei
propertiesi
attackj
defense
attacki
originally
bix
size1
size2
rangefreqquery
queryint
rangefreqqueryint
targetword
firstword
secondword
021
k-repeating
blacklisted
minimizes
optimize
blacklist
bx1
by2
by1
ax2
bx2
rectilinear
ay1
ay2
ax1
out-of-order
curs
cur
k-bit
approved
transdate
declined
maxlen
46
peekingiterator
peekingiteratoriteratorint
combinationlength
combinationiterator
combinationiteratorstring
v2
v1
u2
vk
uk
u1
matrixxy
examinations
attended
studentid
subjects
subjectname
studentname
subject
indiceslength
reverses
catches
bumper
one-lane
faster
slow
drive
slower
catch
fleet
fleets
homework
querytime
endtime
starttime
lays
sourcesi
sources
targetsi
targets
eeecd
replacements
testcase
abbc
unnecessary
covers
farmer
apex
bottommost
fertile
pyramidal
farmland
barren
transactionid
mall
visitid
countintervals
allocateint
allocator
freeint
allocatorint
freed
functionalities
growing
consuming
partially
graphical
iteration
majority
interview
fly
acosti
bcosti
costsi
flying
groupsize
handi
hiredate
salespersons
commissionrate
comid
salesperson
alongside
commission
salesid
maxai
tripletsj
max3
bj
maxbi
tripletsi
max5
maxci
max2
popping
popfront
popback
frontmiddleback
pushfrontint
pushmiddleint
pushbackint
popmiddle
frontmost
aec
minitial
malware
graphij
adjacency
maxarr0i
conver
nums0i
converi
labelling
sixth
housesi
12233211
summer
neighborhood
yet
neighborhoods
throws
server-to-server
critical
solitaire
beautifully
arraylast
watchedvideos
general
watched
friendsi
watchedvideosi
newflowers
planting
caretaker
incomplete
trivially
pixel
sr
imageij
sc
imagesrsc
pixels
fi
579
123456579
flength
director
cooperated
actordirector
actor
directorid
actorid
sortedarray
sortedarr
speeds
performance
efficiencyi
engineers
terminal
leads
whereas
bomb
detonate
bombs
felt
bombsi
detonated
baaba0
baaabb0
re-use
pool
desiredtotal
maxchoosableinteger
force
selects
cmove
rmove
nottobeval
tobeval
developers
throw
helps
expect
abcc
numsansi
appearing
fewest
snap
setindex
took
snapid
snapshotarrayint
array-like
snapshot
getindex
snapshotarray
multilevel
single-level
currnext
chips
chip
russian
doll
envelopesi
envelope
envelopes
numsmiddleindex2
numsmiddleindex-1
numsmiddleindex1
middleindex
strs00
strs0strs0length
strs1strs1length
strs10
strs11
strs01
therere
minjump
maxjump
fulfilled
functionality
statuses
3k
sxy
sij
formulas
h2o2he3mg4
atom
h2o23
chemical
h2o
h1o2
h2o2
atomic
reminder
exponent
python
powerful
sensitive
ooo
ll
stretchy
feeling
hiiii
hellooo
lllll
heeellooo
oo
helllllooo
extension
helloo
indexs
alicevalues
bobvalues
differently
bobvaluesi
alicevaluesi
numsinumslength
357
numsii
159
groupi
beforeitemsi
dominoeslength
dominoesj
dominoes
dominoesi
root1
root2
sright
sleft
assorted
wallet
lfucacheint
incremented
lfucache
invalidated
lfu
groupby
arraygroupbyfn
lodashs
look
getpos
getdir
robotint
awaits
stepint
retries
instructs
bcdea
eggs
egg
breaks
certainty
unbroken
1234567654321
1234567
express
suf
presuf
546
pre
abbreviated
abbreviate
presufec
1234589876e5
12345678987600000
1234554321
semi-ordered
rowindexth
rowindex
dont
horizontallyvertically
isnt
sumfirst
sumsecond
sunday
friday
tuesday
saturday
monday
wednesday
thursday
week
getmin
retrieving
minstack
cityai
citybi
loop
nextlargest
12321
punishment
airline
jfk
lgb
